Power-Law/wedge_needles/temperature/55_temp/45_needle_layer/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          59;
        startFace       112846;
    }
    outlet
    {
        type            patch;
        nFaces          59;
        startFace       112905;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          965;
        startFace       112964;
    }
    wedge1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          56935;
        startFace       113929;
    }
    wedge2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          56935;
        startFace       170864;
    }
)

// ************************************************************************* //
